Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/удуПриказОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОЗачисленииРебенкаВГруппу</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольВместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомплектация</name>
    <type>
      <types>DocumentRef.удуКомплектованиеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗачисление</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСоставСемьиРебенка/удуСоставСемьиРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСоставСемьиРебенка</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.удуСтепениРодства</types>
    </type>
  </resources>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧленСемьи</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()
	ПечатнаяФорма = Новый ТабличныйДокумент;
	
	ДокументОбъект = Элементы.Список.ВыделенныеСтроки[0];
	
	Макет = ДокументОбъект.ПолучитьОбъект().ПолучитьМакет("Макет");
	
	СекцияШапка = Макет.ПолучитьОбласть("Шапка");
	СекцияСтрока = Макет.ПолучитьОбласть("Строка");
	
	ПечатнаяФорма.Вывести(СекцияШапка);
	
	Для Каждого ДокументВМассиве Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ДокументВМассиве.Проведен Тогда
			Для Каждого СтрокаЗачисления Из ДокументВМассиве.ТабличнаяЧастьЗачисление Цикл
				СекцияСтрока.Параметры.НомерИДатаПриказа = "Приказ о зачислении №" + удуФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДокументВМассиве.Номер) + " от " + Формат(ДокументВМассиве.Дата, "ДЛФ=D");
				СекцияСтрока.Параметры.СсылкаНаДокумент = ДокументВМассиве;
				
				МассивФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЗачисления.ОснованиеЗачисления.Ребенок.Наименование, " ");
				ПредставлениеФИО = "";
				Если МассивФИО.Количество() = 3 Тогда 
					ПредставлениеФИО = СокрЛП(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + ". " + Лев(МассивФИО[2], 1) + ".";
				ИначеЕсли МассивФИО.Количество() = 2 Тогда
					ПредставлениеФИО = СокрЛП(МассивФИО[0]) + " " + Лев(МассивФИО[1], 1) + ".";
				Иначе
					ПредставлениеФИО = СокрЛП(МассивФИО[0])
				КонецЕсли;
				
			    СекцияСтрока.Параметры.ФИОРебенка = ПредставлениеФИО;
				СекцияСтрока.Параметры.Ребенок = СтрокаЗачисления.ОснованиеЗачисления.Ребенок;
				СекцияСтрока.Параметры.ДатаРождения = СтрокаЗачисления.ОснованиеЗачисления.Ребенок.ДатаРождения;
				
				СекцияСтрока.Параметры.ГруппаНаименование = СокрЛП(ДокументВМассиве.Группа.Наименование);
				СекцияСтрока.Параметры.Группа = ДокументВМассиве.Группа;
				СекцияСтрока.Параметры.ДатаЗачисления = ДокументВМассиве.ДатаФактическогоЗачисления;
				
				СекцияСтрока.Параметры.ОснованиеЗачисленияПредставление = "Договор о зачислении №" + удуФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СтрокаЗачисления.ОснованиеЗачисления.Номер) + " от " + Формат(СтрокаЗачисления.ОснованиеЗачисления.Дата, "ДЛФ=D");
				СекцияСтрока.Параметры.ОснованиеЗачисления = СтрокаЗачисления.ОснованиеЗачисления;
				
				СекцияСтрока.Параметры.РодительНаименование = СокрЛП(СтрокаЗачисления.ОснованиеЗачисления.Родитель.Наименование);
				
				// получим степень родства родителя
				Отбор = Новый Структура;
				Отбор.Вставить("Ребенок", СтрокаЗачисления.ОснованиеЗачисления.Ребенок);
				Отбор.Вставить("ЧленСемьи", СтрокаЗачисления.ОснованиеЗачисления.Родитель);
				СтепеньРодства = РегистрыСведений.удуСоставСемьиРебенка.ПолучитьПоследнее(ТекущаяДата(), Отбор).СтепеньРодства;
				Если ЗначениеЗаполнено(СтепеньРодства) Тогда
					СекцияСтрока.Параметры.РодительНаименование = СекцияСтрока.Параметры.РодительНаименование + " (" + СокрЛП(СтепеньРодства.Наименование) + ")";	
				КонецЕсли;
				// получим степень родства родителя
				
				СекцияСтрока.Параметры.Родитель = СтрокаЗачисления.ОснованиеЗачисления.Родитель;
				
				ПечатнаяФорма.Вывести(СекцияСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПечатнаяФорма;
КонецФункции

&НаКлиенте
Процедура КомандаПечатьКнигиПриказов(Команда)
	// Вставить содержимое обработчика.
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		ТабличныйДокумент = СформироватьПечатнуюФормуНаСервере();		
		
		ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
		ТабличныйДокумент.ТолькоПросмотр = Истина;		
		ТабличныйДокумент.Показать();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);	
КонецПроцедуры
